Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ServiceFactory
The Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ServiceFactory class provides utility factory methods for the API.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ServiceFactory.CreateContextualToolbar(Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase)
Creates a contextual toolbar.
feature: The feature.
Returns:
An instance of Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ServiceFactory.CreateHighlighter(Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase)
Creates a highlighter.
feature: The feature.
Returns:
A Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter to highlight objects in the model.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ServiceFactory.CreatePickingTool(Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentCreationFeatureBase,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes)
Creates a picking tool.
feature: The feature.
inputRange: The input range.
inputTypes: The input types.
Returns:
A picking tool.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ServiceFactory.CreatePickingTool(Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartCreationFeatureBase,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputRange,Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputTypes)
Creates a picking tool.
feature: The feature.
inputRange: The input range.
inputTypes: The input types.
Returns:
A picking tool.